Revit 2027 API
FillGrid.IsEqual Method
 Check if two fill grids are equal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	FillGrid other
)
Public Function IsEqual (
	other As FillGrid
) As Boolean
public:
bool IsEqual(
	FillGrid^ other
)
member IsEqual :
        other : FillGrid -> bool
Parameters
other FillGrid
 The fill grid to be compared.
Return Value
Boolean
 True if the two fill grids are equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace